from collections import (
    OrderedDict,
)

from kinder.core.dict.models import (
    WorkType,
)


APPLICATION_INDEXES = OrderedDict(
    [
        ('1', '(1)Общее количество детей, поставленных на учет в текущем календарном году'),
        (
            '1.1',
            '(1.1)Общее число заявлений, поданных для постановки '
            'на учет, в разрезе возрастных категорий %s (на текущую дату)',
        ),
        ('2.1', '(2.1)Общее количество заявлений поданных с портала, в возрасте %s (на текущую дату)'),
        ('3.1', '(3.1)Общее количество заявлений поданных при личном обращении, в возрасте %s (на текущую дату)'),
        (
            '4',
            '(4)Общее количество детей, поставленных на учет '
            'для получения места в текущем учебном году, '
            'для детей в возрасте %s (на текущую дату)',
        ),
        (
            '4.1',
            '(4.1)Общее количество детей, поставленных на учет в группы '
            'для детей с овз для получения места в текущем учебном году '
            '(компенсирующие группы) детей в возрасте %s (на текущую дату)',
        ),
        (
            '4.2',
            '(4.2)Общее количество детей, поставленных на '
            'учет в оздоровительные группы в возрасте %s (на текущую дату)',
        ),
        (
            '5',
            '(5)Общее количество детей, поставленных на учет для '
            'получения места в текущем учебном году в другой ДОО, '
            'детей в возрасте %s (на текущую дату)',
        ),
        (
            '6',
            '(6)Общее количество заявлений, поданных для постановки '
            'на учет для зачисления в группы кратковременного '
            'пребывания детей, для детей в возрасте %s (на текущую дату)',
        ),
    ]
)


QUEUE_INDEXES = OrderedDict(
    [
        (
            '7',
            '(7)Численность детей, стоящих на учете '
            '(отложенный спрос) в возрасте %s '
            '(на 1 сентября текущего календарного года)',
        ),
        ('7.1', '(7.1)Численность детей, стоящих на учете (отложенный спрос) в возрасте %s (на текущую дату)'),
        (
            '7.2',
            '(7.2)Численность детей, желающих получить '
            'место в текущем учебном году '
            '(спрос на текущий учебный год), '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '7.3',
            '(7.3)Численность детей, желающих получить место в следующем '
            'учебном году (отложенный спрос на следующий учебный год) '
            'год в возрасте %s (на текущую дату)',
        ),
        (
            '7.4',
            '(7.4)Численность направленных в ДОО детей, желающих '
            'получить место в текущем учебном году '
            '(удовлетворенный спрос на текущий учебный год) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '7.5',
            '(7.5)Численность детей, желающих получить место в следующем '
            'учебном году и ранее (актуальный спрос на следующий учебный '
            'год) в возрасте %s (на текущую дату)',
        ),
        (
            '7.6',
            '(7.6)Численность детей, желающих получить место в следующем '
            'учебном году и ранее (актуальный спрос на следующий учебный '
            'год) в возрасте %s (на первое сентября следующего '
            'учебного года)',
        ),
        (
            '7.7',
            '(7.7)Численность детей, желающих получить место в следующем '
            'учебном году и ранее (удовлетворенный спрос на следующий учебный'
            'год) в возрасте %s (на первое сентября следующего '
            'учебного года)',
        ),
        ('8', '(8)Среднее время ожидания места, в возрасте %s (на желаемую дату зачисления)'),
        ('8.1', '(8.1)Среднее время ожидания места для детей без льгот, в возрасте %s (на желаемую дату зачисления)'),
        (
            '8.2',
            '(8.2)Среднее время ожидания места для детей, имеющих льготы, в возрасте %s (на желаемую дату зачисления)',
        ),
        ('8.3', '(8.3)Среднее время ожидания места для детей с ОВЗ, в возрасте %s (на желаемую дату зачисления)'),
        (
            '9',
            '(9)Общая численность детей в очереди, '
            'имеющих право на внеочередное или первоочередное зачисление '
            'возрасте %s (на 1 сентября текущего календарного года)',
        ),
        (
            '9.1',
            '(9.1)Общая численность детей в очереди, имеющих '
            'право на внеочередное или первоочередное зачисление '
            'возрасте %s (на текущую дату)',
        ),
        (
            '10',
            '(10)Общая численность детей в очереди, имеющих '
            'право на внеочередное или первоочередное зачисление '
            'на основании федеральных льгот',
        ),
        (
            '10.1',
            '(10.1)Общая численность детей в очереди, имеющих право на '
            'первоочередное зачисление в связи с их инвалидностью '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '11',
            '(11)Общая численность детей в очереди, имеющих '
            'право на внеочередное или первоочередное зачисление '
            'на основании региональных льгот',
        ),
        (
            '12',
            '(12)Общая численность детей с ограниченными возможностями '
            'здоровья в очереди. в возрасте %s (на текущую дату)',
        ),
        (
            '12.1',
            '(12.1)Численность детей с ограниченными возможностями '
            'здоровья в очереди (удовлетворенный спрос) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '13',
            '(13)Численность детей с ограниченными возможностями '
            'здоровья в очереди, которые могут обучаться в '
            'общеразвивающих группах, в возрасте %s (на текущую дату)',
        ),
        (
            '13.1',
            '(13.1)Численность детей с ограниченными возможностями '
            'здоровья в очереди (частично удовлетворенный спрос) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '14',
            '(14)Общая численность детей в очереди, '
            'нуждающихся в группах оздоровительной направленности, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '15',
            '(15)Общая численность детей в очереди, согласных '
            'получить место в группах по присмотру и уходу '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '16',
            '(16)Общая численность детей в очереди, желающих получить '
            'место в группах круглосуточного пребывания детей, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '17',
            '(17)Общая численность детей в очереди, желающих получить '
            'место в группах кратковременного пребывания детей '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '17.1',
            '(17.1)Общая численность детей в очереди, согласных получить '
            'место в группах кратковременного пребывания '
            'детей в возрасте %s (на текущую дату)',
        ),
        (
            '18',
            '(18)Общая численность детей в очереди, '
            'не обеспеченных местами в ДОО (актуальный спрос) в '
            'возрасте %s (на 1 сентября текущего календарного года)',
        ),
        (
            '18.1',
            '(18.1)Общая численность детей в очереди, не обеспеченных '
            'местами в ДОО (актуальный спрос) в '
            'возрасте %s (на текущую дату)',
        ),
        (
            '18.2',
            '(18.2)Общая численность детей в очереди, '
            'не обеспеченных местами в ДОО (актуальный спрос), '
            'в возрасте %s (1 января следующего календарного года)',
        ),
        (
            '18.3',
            '(18.3)Общая численность детей в очереди, обеспеченных '
            'местами в ДОО (удовлетворенный актуальный спрос), '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '18.4',
            '(18.4)Численность детей в очереди, не обеспеченных местами в ДОО'
            '(текущий спрос), в возрасте %s (на текущую дату)',
        ),
        (
            '18.5',
            '(18.5)Общая численность детей в очереди, не обеспеченных '
            'местами в ДОО (общий спрос), в возрасте %s (на текущую дату)',
        ),
    ]
)


ENROLLED_INDEXES = OrderedDict(
    [
        (
            '19',
            '(19)Общая численность детей, зачисленных в ДОО, в возрасте %s (на 1 сентября текущего календарного года)',
        ),
        ('19.1', '(19.1)Общая численность детей, зачисленных в ДОО, в возрасте %s (на текущую дату)'),
        (
            '19.2',
            '(19.2)Общая численность детей, зачисленных в ДОО, в возрасте %s (1 января следующего календарного года)',
        ),
        ('19.3', '(19.3)Прогнозируемое увеличение контингента воспитанников, в возрасте %s (на текущую дату)'),
        ('20', '(20)Общая численность детей, желающих перейти в данную ДОО, в возрасте %s (на текущую дату)'),
        (
            '20.1',
            '(20.1)Общая численность детей, желающих перейти в '
            'данную ДОО (удовлетворенный спрос), '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '20.2',
            '(20.2)Общая численность детей, желающих получить '
            'место в данную ДОО в группах для детей с ограниченными '
            'возможностями здоровья, в возрасте %s (на текущую дату)',
        ),
        (
            '20.3',
            '(20.3)Общая численность детей, желающих перейти '
            'в данную ДОО в текущем учебном году, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '20.4',
            '(20.4)Общая численность детей, желающих перейти в '
            'данную ДОО в более поздние сроки, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '20.5',
            '(20.5)Общая численность детей в очереди, желающих получить '
            'иное место в ДОО (общий спрос из желающих сменить ДОО) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '20.6',
            '(20.6)Общая численность детей в очереди, желающих получить '
            'иное место в ДОО (по причине изменения режима пребывания '
            'ребенка в группе) в возрасте %s (на текущую дату)',
        ),
        (
            '20.7',
            '(20.7)Общая численность детей в очереди, желающих получить '
            'иное место в ДОО (по причине изменения направленности группы) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '20.8',
            '(20.8)Общая численность детей в очереди, желающих получить '
            'иное место в ДОО (по причине изменения типа собственности) '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '21',
            '(21)Общая численность детей, получающих дошкольное '
            'образование в семейных дошкольных группах, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22',
            '(22)Общая численность детей, зачисленных в группы для детей '
            'с ограниченными возможностями здоровья, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.1',
            '(22.1)Общая численность детей, зачисленных в группы для детей '
            'с нарушением слуха,'
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.1.1',
            '(22.1.1)Общая численность детей, зачисленных в группы для детей '
            'с нарушением слуха(глухие),'
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.1.2',
            '(22.1.2)Общая численность детей, зачисленных в группы для детей '
            'с нарушением слуха(слабослышащие и позднооглохшие),'
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.2',
            '(22.2)Общая численность детей, зачисленных в группы для детей '
            'с нарушением речи, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.3',
            '(22.3)Общая численность детей, зачисленных в группы для детей '
            'с нарушением зрения, '
            'в возрасте %s (на текущую дату)',
        ),
        ('22.3.1', '(22.3.1)Численность детей с ОВЗ, зачисленных в группы для детей с нарушением зрения (слепые)'),
        (
            '22.3.2',
            '(22.3.2)Численность детей с ОВЗ, зачисленных в группы для детей с нарушением зрения (слабовидящие)',
        ),
        (
            '22.4',
            '(22.4)Общая численность детей, зачисленных в группы для детей '
            'с нарушением интеллекта, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.5',
            '(22.5)Общая численность детей, зачисленных в группы для детей '
            'с задержкой психического развития, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.5.1',
            '(22.5.1)Численность детей с ОВЗ, зачисленных в группы для '
            'детей с задержкой психического развития, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.5.2',
            '(22.5.2)Численность детей с ОВЗ, зачисленных в группы для '
            'детей с расстройством аутистического спектра, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.6',
            '(22.6)Общая численность детей, зачисленных в группы для детей '
            'с нарушением опорно-двигательного аппарата, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.7',
            '(22.7)Общая численность детей, зачисленных в группы для детей '
            'со сложным дефектом, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.8',
            '(22.8)Общая численность детей, зачисленных в группы для детей '
            'с иными ограниченными возможностями здоровья, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.8.1',
            '(22.8.1)Общая численность детей, зачисленных в группы для '
            'детей с синдромом дефицита внимания и гиперактивности (СДВГ), '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '22.8.2',
            '(22.8.2)Общая численность детей, зачисленных в группы для '
            'детей после операции по кохлеарной имплантации, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '23',
            '(23)Общая численность детей, зачисленных в группы '
            'компенсирующей направленности, в возрасте %s (на текущую дату)',
        ),
        (
            '24',
            '(24)Общая численность детей, зачисленных в группы '
            'оздоровительной направленности, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '25',
            '(25)Общая численность детей, зачисленных в группы по присмотру и уходу, в возрасте %s (на текущую дату)',
        ),
        (
            '26',
            '(26)Общая численность детей, посещающих группы '
            'круглосуточного пребывания детей, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '27',
            '(27)Общая численность детей, зачисленных в группы '
            'кратковременного пребывания детей, '
            'в возрасте %s (на текущую дату)',
        ),
        (
            '28',
            '(28)Общая численность детей, посещающих ДОО в режиме '
            'кратковременного пребывания, в возрасте %s (на текущую дату)',
        ),
        ('29', '(29)Прогнозируемое уменьшение контингента'),
        (
            '29.1',
            '(29.1)Прогнозируемое уменьшение контингента воспитанников в '
            'связи с переходом в другую ДОО в возрасте %s (на текущую дату)',
        ),
        (
            '29.2',
            '(29.2)Фактическое уменьшение контингента воспитанников в текущем учебном году '
            'в возрасте %s (на дату приказа об отчислении)',
        ),
        (
            '29.3',
            '(29.3)Фактическое уменьшение контингента воспитанников '
            'в связи с уходом в школу в текущем учебном году '
            'в возрасте %s (на 1 сентября следующего учебного года)',
        ),
        (
            '30',
            '(30)Численность детей-инвалидов, не имеющих ограниченных '
            'возможностей здоровья, в возрасте %s (на текущую дату)',
        ),
        (
            '30.1',
            '(30.1)Численность детей-инвалидов, имеющих ограниченные '
            'возможности здоровья, в возрасте %s (на текущую дату)',
        ),
        (
            '30.2',
            '(30.2)Численность детей, не имеющих инвалидности, '
            'но имеющих ограниченные возможности здоровья, '
            'в возрасте %s (на текущую дату)',
        ),
    ]
)


CAPACITIES_INDEXES = OrderedDict(
    [
        ('31', '(31)Количество свободных мест на дату сбора отчетности в возрастных группах, в возрасте %s'),
        (
            '31.1',
            '(31.1)Количество свободных мест в группах для детей с ограниченными возможностями здоровья в возрасте %s',
        ),
        ('31.2', '(31.2)Количество свободных мест в группах для детей компенсирующей направленности в возрасте %s'),
        ('31.3', '(31.3)Количество свободных мест в группах для детей оздоровительной направленности в возрасте %s'),
        (
            '31.4',
            '(31.4)Количество свободных мест в группах кратковременного '
            'пребывания в государственных '
            'образовательных организациях в возрасте %s',
        ),
        (
            '32',
            '(32)Численность детей, получивших направления в ДОО '
            'и зачисленных в ДОО в текущем календарном году,'
            'в возрасте %s',
        ),
        (
            '32.1',
            '(32.1)Общая численность детей, получивших направления в ДОО,в текущем календарном году, в возрасте %s',
        ),
        (
            '32.2',
            '(32.2)Численность детей, получивших направления в ДОО, не воспользовавшихся предоставленным местом %s',
        ),
        ('33', '(33)Численность детей, выбывших из очереди по иным причинамв возрасте %s'),
    ]
)


def get_all_day_work_types():
    work_types = WorkType.objects.all()
    all_day_types = [WorkType.ALLDAY]
    for work_type in work_types:
        code = work_type.code
        try:
            torn_code = code.split('-')
        except AttributeError:
            # Код может быть не заполнен
            continue

        map_code = torn_code[0]
        map_code = map_code.replace(',', '.')
        try:
            numeric_map_code = float(map_code)
        except ValueError:
            continue

        if numeric_map_code == 24:
            all_day_types.append(work_type.code)

    return all_day_types


def get_short_day_types():
    work_types = WorkType.objects.all()
    short_types = [WorkType.SHORT]
    for work_type in work_types:
        code = work_type.code
        try:
            torn_code = code.split('-')
        except AttributeError:
            # Код может быть не заполнен
            continue

        map_code = torn_code[0]
        map_code = map_code.replace(',', '.')
        try:
            numeric_map_code = float(map_code)
        except ValueError:
            continue

        if 1 <= numeric_map_code < 8:
            short_types.append(work_type.code)

    return short_types
