"""
Электронное Взаимодействие с Региональным Сегментом в Сфере
Дошкольного Образования.

Для нормального функционирования плагина в IE,
нужно добавить домен сервера в *'Надежные сайты'*
и разрешить использование *ActiveX* компонент,
не помеченныx как безопасные для использования.

Для генерации подписи на клинте должен быть  установлен
**КриптоПро CSP** (http://cryptopro.ru/products/csp/overview),
и сгенерирован сертификат ключа подписи.
"""

default_app_config = 'gisdo.apps.GisdoConfig'
