import random


# function to replace a random number of words in a sentence with a face
def replace_with_faces(sentence: str) -> str:
    faces = {
        0: "૮ ˶ᵔ ᵕ ᵔ˶ ა",
        1: "ପ(๑•ᴗ•๑)ଓ ♡",
        2: "૮꒰ ˶• ༝ •˶꒱ა ♡",
        3: "૮₍ ˃ ⤙ ˂ ₎ა",
        4: "₍ᐢ.  ̫.ᐢ₎",
        5: "૮ ˶´ ᵕˋ ˶ა",
        6: "(づ ᴗ _ᴗ)づ♡",
        7: "(*ᴗ͈ˬᴗ͈)ꕤ*.ﾟ",
        8: "ଘ(੭ˊᵕˋ)੭",
        9: "´っω=`)",
        10: "₍ᐢ× ༝ ×ᐢ₎",
        11: "( ꩜ ᯅ ꩜;)⁭⁭",
        12: "₍^⸝⸝> ·̫ <⸝⸝ ^₎",
        13: "(´,,>ω<,,`)♡",
        14: "₍ᐢ> ̫<ᐢ₎",
        15: "(´･ω･`):",
        16: "( ;´꒳`;) ",
        17: "₍ᐡඉ ̫ඉᐡ₎",
        18: "ᐡ⸝⸝> ̫ <⸝⸝ᐡ",
        19: "₍ᐡ-᷅ ·̫ -᷄ᐡ₎",
        20: "⸜(*ˊᗜˋ*)⸝",
        21: "٩̋(ˊ•͈ ꇴ •͈ˋ)و",
        22: "(ヾﾉ･ω･`)",
        23: "(๑´`๑)♡",
        24: "˃̣̣̥᷄ ᴖ ˂̣̣̥᷅",
        25: "ᐡ ᐧ ﻌ ᐧ ᐡ",
        26: "(⸝⸝º ^ º⸝⸝ )",
        27: "( ˊᵕˋ ; )",
        28: "( ᴗ ̫ ᴗ )",
        29: "(๑♡⌓♡๑)",
        30: "⸜(｡˃ ᵕ ˂ )⸝",
        31: "₍ᐢ˶• ˔ กᐢ₎",
        32: "૮₍ ˃̵͈᷄ . ˂̵͈᷅ ₎ა",
        33: "ᐢ•ﻌ•ᐢ₎",
        34: "( ´͈ ᗨ `͈ )",
        35: "๑´ ³`)ﾉ",
        36: "ଘ( ິ•ᆺ• )ິଓ",
        37: "꒰˘꒳˘๑꒱",
        38: "໒(＾ᴥ＾)७",
        39: "◟꒰◍ ´꒳` ◍꒱◞",
        40: "˘ ᵜ ˘",
        41: "( •ω•ฅ)",
        42: "ʕ·ᴥ·ʔ",
        43: "(๑´ㅂ`๑)",
        44: "(๑•́ ₃ •̀๑)",
        45: "ต( ິᵒ̴̶̷̤ ﻌ ᵒ̴̶̷̤ )ິ",
        46: "ฅ՞•ﻌ•՞ฅ",
        47: "(´๑•_•๑)",
        48: "Ꮚ˘ ꈊ ˘ Ꮚ",
        49: "₍˄·͈༝·͈˄₎◞ ̑̑",
        50: "(ㅅ´ ˘ `)",
        51: "(˃ ⌑ ˂ഃ )",
        52: "(❁ᴗ͈ˬᴗ͈)",
        53: "₍⑅ᐢ..ᐢ₎",
        54: "૮₍•᷄ ࡇ •᷅₎ა",
        55: "( ⸝⸝´꒳`⸝⸝)",
        56: "(๑ᵔ⤙ᵔ๑)",
        57: "٩(ˊᗜˋ*)و ♡",
        58: "(´｡• ◡ •｡`) ♡",
        59: "☆૮꒰•༝  •。꒱ა",
        60: "૮ ◞ ﻌ ◟ ა",
        61: "(─‿‿─)",
        62: "૮₍˶ •. • ⑅₎ა ♡",
        63: "🐾૮ ᴖﻌᴖა",
        64: "⸜(｡˃ ᵕ ˂ )⸝",
        65: "(๑•ᴗ•๑)♡",
        66: "( ｡ •̀ ᴖ •́ ｡)",
        67: "ᑦ(੭・㉨・)ᐣ",
        68: "ฅ՞•ﻌ•՞ฅ",
        69: "（≧∇≦）",
        70: "(*≧∀≦*)",
        71: "(๑˃̵ᴗ˂̵)",
        72: "(๑>◡<๑)",
        73: "˃̵ᴗ˂̵",
        74: "ヾ( ˃ᴗ˂ )◞ • *✰"
    }
    words = sentence.split(' ')
    length = len(words)

    # if user input is correct
    if sentence != '':
        if length > 0:
            num_to_replace = random.randint(
                1, length)  # random number of words to replace

            for _ in range(num_to_replace):
                rand_index = random.randint(0, length -
                                            1)  # choose word to replace
                rand_face = random.randint(0,
                                           74)  # choose face to replace with
                words[rand_index] = faces[rand_face]

            return ' '.join(words)

    return 'Please enter a sentence'
